app/controllers/api/v1/menu_items_controller.rb

SELECT "menu_items".* FROM "menu_items"
---
    def index
        menu_items = MenuItem.all