app/controllers/api/v1/orders_controller.rb

    def index
        orders = Order.all
---
SELECT "orders".* FROM "orders"

    def create
        order = Order.create!(order_params)
---
INSERT INTO "orders" ("name", "phone", "card", "total", "completed", "created_at", "updated_at", "address", "text") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def show
        order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def update
        order = Order.find(params[:id])
        order.update(text: params[:text])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "orders" SET "text" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["text", "the same"], ["updated_at", "2021-01-26 22:40:51.142446"], ["id", 74]]

    def destroy
        order = Order.find(params[:id])
        order.destroy!
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 43]]