app/controllers/api/v1/order_items_controller.rb

SELECT "order_items".* FROM "order_items"
---
    def index
        order_items = OrderItem.all

INSERT INTO "order_items" ("order_id", "menu_item_id", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 5], ["menu_item_id", 1], ["created_at", "2021-01-25 22:03:02.743614"], ["updated_at", "2021-01-25 22:03:02.743614"], ["quantity", 3]]
---
    def create
        order_item = OrderItem.create!(order_item_params)